# EndOrTopTermination Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType..::..EndOrTopTermination Property
ContinuousRailType Class See Also
---
The termination of the rail at the end or top.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId EndOrTopTermination { get; set; }
```

Visual Basic
---
```text
Public Property EndOrTopTermination As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ EndOrTopTermination {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The termination is not a valid termination symbol for continuous rail. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace